#include <inttypes.h>

#include "errors.h"

uint8_t		p0102[] = {"Низкий уровень сигнала с датчика расхода воздуха"};
uint8_t		p0103[] = {"Высокий уровень сигнала с датчика расхода воздуха"};
uint8_t		p0117[] = {"Низкий уровень сигнала с датчика температуры охлаждающей жидкости"};
uint8_t		p0118[] = {"Высокий уровень сигнала с датчика температуры охлаждающей жидкости"};
uint8_t		p0122[] = {"Низкий уровень сигнала с датчика положения дросселя"};
uint8_t		p0123[] = {"Высокий уровень сигнала с датчика положения дросселя"};
uint8_t		p0131[] = {"Низкий уровень сигнала с датчика кислорода"};
uint8_t		p0132[] = {"Высокий уровень сигнала с датчика кислорода"};
uint8_t		p0134[] = {"Нет активности датчика кислорода"};
uint8_t		p0135[] = {"Обрыв нагревателя датчика кислорода"};
uint8_t		p0171[] = {"Система слишком бедная"};
uint8_t		p0172[] = {"Система слишком богатая"};
uint8_t		p0201[] = {"Цепь управления форсункой  №1, обрыв"};
uint8_t		p0202[] = {"Цепь управления форсункой  №2, обрыв"};
uint8_t		p0203[] = {"Цепь управления форсункой  №3, обрыв"};
uint8_t		p0204[] = {"Цепь управления форсункой  №4, обрыв"};
uint8_t		p0261[] = {"Цепь управления форсункой  №1, замкнута на землю"};
uint8_t		p0262[] = {"Цепь управления форсункой  №1, замкнута на +12В"};
uint8_t		p0264[] = {"Цепь управления форсункой  №2, замкнута на землю"};
uint8_t		p0265[] = {"Цепь управления форсункой  №2, замкнута на +12В"};
uint8_t		p0267[] = {"Цепь управления форсункой  №3, замкнута на землю"};
uint8_t		p0268[] = {"Цепь управления форсункой  №3, замкнута на +12В"};
uint8_t		p0270[] = {"Цепь управления форсункой  №4, замкнута на землю"};
uint8_t		p0271[] = {"Цепь управления форсункой  №4, замкнута на +12В"};
uint8_t		p0325[] = {"Обрыв датчика детонации"};
uint8_t		p0327[] = {"Низкий уровень шума двигателя"};
uint8_t		p0328[] = {"Высокий уровень шума двигателя"};
uint8_t		p0335[] = {"Ошибка датчика синхронизации КВ"};
uint8_t		p0340[] = {"Ошибка датчика фазы"};
uint8_t		p0443[] = {"Неисправность управления клапаном продувки адсорбера"};
uint8_t		p0480[] = {"Неисправность цепи управления вентилятором №1"};
uint8_t		p0501[] = {"Ошибка датчика скорости автомобиля"};
uint8_t		p0505[] = {"Ошибка регулятора холостого хода"};
uint8_t		p0562[] = {"Низкое бортовое напряжение"};
uint8_t		p0563[] = {"Высокое бортовое напряжение"};
uint8_t		p0601[] = {"Ошибка ПЗУ"};
uint8_t		p0603[] = {"Ошибка ОЗУ"};
uint8_t		p1410[] = {"Цепь управления клапаном продувки адсорбера, замыкание на +12В"};
uint8_t		p1425[] = {"Цепь управления клапаном продувки адсорбера, замыкание на землю"};
uint8_t		p1426[] = {"Цепь управления клапаном продувки адсорбера, обрыв"};
uint8_t		p1501[] = {"Цепь управления реле бензонасоса, замыкание на землю"};
uint8_t		p1502[] = {"Цепь управления реле бензонасоса, замыкание на +12В"};
uint8_t		p1509[] = {"Цепь управления регулятором холостого хода, перегрузка"};
uint8_t		p1513[] = {"Цепь управления регулятором холостого хода, замыкание на землю"};
uint8_t		p1514[] = {"Цепь управления регулятором холостого хода, обрыв или замыкание на +12В"};
uint8_t		p1541[] = {"Цепь управления реле бензонасоса, обрыв"};
uint8_t		p1600[] = {"Нет связи с иммобилизатором"};
uint8_t		p1602[] = {"Пропадание напряжения бортсети"};
uint8_t		p1603[] = {"Ошибка EEPROM"};
uint8_t		p1612[] = {"Ошибка сброса блока управления"};


ERRORS emsg[] = {
    {102, p0102},
    {103, p0103},
    {117, p0117},
    {118, p0118},
    {122, p0122},
    {123, p0123},
    {131, p0131},
    {132, p0132},
    {134, p0134},
    {135, p0135},
    {171, p0171},
    {172, p0172},
    {201, p0201},
    {202, p0202},
    {203, p0203},
    {204, p0204},
    {261, p0261},
    {262, p0262},
    {264, p0264},
    {265, p0265},
    {267, p0267},
    {268, p0268},
    {270, p0270},
    {271, p0271},
    {325, p0325},
    {327, p0327},
    {328, p0328},
    {335, p0335},
    {340, p0340},
    {443, p0443},
    {480, p0480},
    {501, p0501},
    {505, p0505},
    {562, p0562},
    {563, p0563},
    {601, p0601},
    {603, p0603},
    {1410,p1410},
    {1425,p1425},
    {1426,p1426},
    {1501,p1501},
    {1502,p1502},
    {1509,p1509},
    {1513,p1513},
    {1514,p1514},
    {1541,p1541},
    {1600,p1600},
    {1602,p1602},
    {1603,p1603},
    {1612,p1612}
};







